app/views/messages/_inbox.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
                <td><%= message.created_at%></td>
                <td><%= link_to h(User.find(message.sender_id).email), user_path(message.sender_id) %></td>