app/views/messages/_sent.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
              <td><%= message.created_at%></td>
              <td><%= link_to h(User.find(message.sender_id).email), user_path(message.sender_id) %></td>