app/views/messages/index.html.erb

    <% @users.each do |p| %>
    <li><a href="#<%=p%>" data-toggle="tab"><%=User.find(p).name%></a></li>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1