app/controllers/home_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def index
    get_user_id
    if @user_id
      @name = User.find(@user_id).name