app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."sender_id" = 1
SELECT "messages".* FROM "messages" WHERE "messages"."recipient_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."recipient_id" = 1 AND "messages"."sender_id" = 3
---
  def index
    user_id = get_user_id
    @messages_sent_by_current = Message.find_all_by_sender_id(user_id)
    @messages_received_by_current = Message.find_all_by_recipient_id(user_id)
    @recipient_id=Array.new
    @messages_sent_by_current.each do |message|
      if @recipient_id.index(message.recipient_id) != -1
        @recipient_id.push message.recipient_id
      end
    end
    @sender_id = Array.new
    @messages_received_by_current.each do |message|
      if @sender_id.index(message.sender_id) != -1
        @sender_id.push message.sender_id
      end
    end
    @people_unmerged = @sender_id.concat(@recipient_id)
    @people = @people_unmerged.uniq

    # Find conversations
    @users=Array.new
    @messages = {}
    @people.each do |p|
      if(User.find(p))
        @users.push p
        @message_from  = Message.find_all_by_recipient_id_and_sender_id(p, user_id)

INSERT INTO "messages" ("body", "created_at", "read_at", "recipient_deleted", "recipient_id", "sender_deleted", "sender_id", "subject", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #can't refactor this part of the code as sender_id reference is not
    #same as user_id ie we can't execute method current_user.messages
    @message = Message.new(params[:message])
    @message.sender_id = current_user.id
    respond_to do |format|
      if @message.save