app/controllers/offers_controller.rb

  def new
    @product_id = params[:product_id]
    if @product_id
      @product = Product.find(params[:product_id])
      if @product.seller_user_id != current_user.id
        @duplicate_offer = Offer.where(:buyer_id => current_user.id, :product_id => @product_id)
        if !@duplicate_offer.any?
          @offer = Offer.new
          @offer.buyer_id = current_user.id
          @offer.product_id = @product_id
          @offer.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "9"]]
SELECT COUNT(*) FROM "offers" WHERE "offers"."buyer_id" = 3 AND "offers"."product_id" = 1
INSERT INTO "offers" ("buyer_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["buyer_id", 7], ["created_at", Fri, 08 Nov 2013 23:28:20 UTC +00:00], ["product_id", 9], ["updated_at", Fri, 08 Nov 2013 23:28:20 UTC +00:00]]

  def destroy
    @offer = Offer.find(params[:id])
    @offer.destroy
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? ORDER BY offers.created_at DESC LIMIT 1  [["id", "2"]]
DELETE FROM "offers" WHERE "offers"."id" = ?  [["id", 2]]

  def index
    @offers= Offer.find_all_by_buyer_id(get_user_id)
---
SELECT "offers".* FROM "offers" WHERE "offers"."buyer_id" = 1 ORDER BY offers.created_at DESC

 def accept
   accepted_offer = Offer.find(params[:id])
   Offer.destroy_all(['id NOT IN (?)', accepted_offer])
   @product=Product.find(accepted_offer.product_id)
   @product.status = Rubeus::SOLD
   @product.save
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? ORDER BY offers.created_at DESC LIMIT 1  [["id", "2"]]
DELETE FROM "offers" WHERE "offers"."id" = ?  [["id", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "products" SET "status" = 'SOLD', "updated_at" = '2013-11-02 18:58:10.775167' WHERE "products"."id" = 4