app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."status" = 'FOR_SALE'
---
  def index
      @products = Product.where(:status => Rubeus::FOR_SALE)

SELECT "products".* FROM "products" WHERE "products"."seller_user_id" = 4
---
  def current_user_product_index
    get_user_id
    @products = Product.find_all_by_seller_user_id(current_user.id)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
  def show
      @product = Product.find(params[:id])
      if user_signed_in?
        @is_signed_in_user_the_owner = @product.seller_user_id == current_user.id
      end
      if @is_signed_in_user_the_owner
        @offer = @product.offers
      else
       # @offer = @product.offers.build
      end
      if current_user
        @user = User.find(current_user.id)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    get_user_id
    @product = Product.find(params[:id])

INSERT INTO "products" ("buyer_user_id", "category", "condition", "created_at", "delete_for", "description", "for_sale", "is_sold", "photo", "price", "seller_user_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #can't refactor this part of the code as seller_user_id reference is not
    #same as user_id ie we can't execute method current_user.products
    @product = Product.new(params[:product])
    @product.seller_user_id = current_user.id
    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "category" = 'Computers', "price" = 15.0, "description" = 'Study lamp. Used for two year.', "status" = 'FOR_SALE', "updated_at" = '2013-11-21 23:55:53.414907' WHERE "products"."id" = 5
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
  def destroy
    @product = Product.find(params[:id])
    if is_product_sold?
      redirect_back_with_sold_alert
    else
      @product.destroy

SELECT "products".* FROM "products" WHERE (title LIKE '%seafood%' OR description LIKE '%seafood%' OR category LIKE '%seafood%' AND status = 'true') ORDER BY price DESC
---
  def search
    @search_param = params[:q]
    @user_id = get_user_id
    @products = Product.search(@search_param)