app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "products".* FROM "products" WHERE "products"."seller_user_id" = 2
SELECT "products".* FROM "products" WHERE "products"."user_id" = 2
---
  def show
    @user = User.find(params[:id])
    products = Product.find_all_by_seller_user_id(params[:id])
    @sold_products =  products.select{|p| p.status == Rubeus::SOLD}

SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1
UPDATE "users" SET "phone_no" = '', "address" = '', "state" = 'PA', "zip_code" = '', "updated_at" = '2013-11-20 21:56:32.176671' WHERE "users"."id" = 4
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])