app/views/products/_product.html.erb

SELECT COUNT(*) FROM "offers" WHERE "offers"."product_id" = 1
---
        <h4 class="pull-right">
            <%= pluralize(product.offers.count, "Offer") %>

SELECT "offers".* FROM "offers" WHERE "offers"."product_id" = 2 AND "offers"."buyer_id" = 1 ORDER BY offers.created_at DESC LIMIT 1
---
            <%else if user_signed_in? %>
                    <% if Offer.find_by_product_id_and_buyer_id(product.id,current_user.id) == nil%>